---
kind: type
id: T:Autodesk.Revit.Exceptions.CannotOpenBothCentralAndLocalException
source: html/13aac793-10be-9bed-90d8-5474a05f0fea.htm
---
# Autodesk.Revit.Exceptions.CannotOpenBothCentralAndLocalException

The exception thrown when both a central model
and also a local file for the same central model are opened in the same session.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class CannotOpenBothCentralAndLocalException : InvalidOperationException
```